{
  "code": 1140018100,
  "name": "17.7.100",
  "changelog": {
    "zh": "* 支持 Android 11 的软键盘动画：神仙级特性！🥳 软键盘可以随着手指一点一点顺滑地收起来了。纯纯写作是全世界第一个适配了这个特性的应用，如果有 Android 11，快来试试吧！\n\n* 全新「顺滑光标」: 支持呼吸式或脉搏式跳动的光标，更温和了，以及顺滑的移动光标动画，不再是瞬间跳跃，更流畅\n\n(👉如果您不想更新，可以长按此通知来关闭此次更新提醒，但我更想推荐大家尽可能更新，因为这是我们费尽心思想要做得更好的新版，它一定不会让您失望的)\n\n* 适配 纯纯写作桌面版、平板和外接键盘\n* 修复 断网时会持续不停地弹「无网络」提示\n* 为华为系统适配边缘长按选择的速度\n* 为 MIUI 适配快捷输入栏弹出动画\n\n* 修复 Markdown 图片自动重新加载导致的位置偏移问题\n* 细节优化：刚启动纯纯写作后，文章最后一行可能会出现短暂的被截断效果\n* 适配 分屏模式\n* 适配 外接键盘以支持「快捷输入栏」和「蓝色填字框」\n* 新增设置项：蓝色填字框，支持关闭该功能\n* 优化「格式化器」，现在起，使用格式化功能后，页面不会自动滚动到末尾了，并且光标也能保留在原来的相对位置\n\n* 支持按回车⏎跳出蓝色填字框，并且有大量更新和优化，性能更好，瞬间启动⚡\n* 修复 蓝色填字框光标位置问题（特别适配 QQ 和 百度输入法）\n* 新增 按回车⏎跳出蓝色填字框功能（试试你的快捷输入项或输入成对符号\"\"）✨\n* 修改「移动光标」按钮到快捷输入栏中央👉【按住该按钮 移动 手指】可顺滑移动光标\n* 全新 快捷输入栏 V3\n* 新增 按回车跳出填字框功能（试试你的快捷输入项）✨\n* 适配 targetSdkVersion 29\n⌘ 支持 有序列表自动补全\n\n* 编辑器 ⇋ Markdown 预览「双向同步滚动」🎉\n* 支持 自动恢复文章滚动停留位置！\n* 更快的启动速度！原来已经极快了，现在更快。灵感稍纵即逝，瞬间启动，最快速度进入写作\n\n* 高级只读模式: 双击文本置入光标并进入编辑模式，返回键隐藏光标\n\n* 对所有页面适配 Android 10 底部手势横条\n* 支持「查找替换」⇋「搜索文章」模式切换\n* 支持在 快捷输入项 中插入日期或时间变量\n* 支持 纯纯写作桌面版字数统计\n* 支持 谷歌云备份\n* 支持「多关键词联合搜索」\n* 新增 更好的快速滚动条滑块，避免边缘手势冲突\n* 通过横向划动编辑器可快速进入 Markdown 预览页面\n* 新增「Markdown 作为新建文章默认模式」设置项\n* 更快的启动速度⚡️，以及丝滑流畅的写作体验",
    "zh-HK": "* 支持 Android 11 的軟鍵盤動畫：神仙級特性！🥳 軟鍵盤可以隨着手指一點一點順滑地收起來了。純純寫作是全世界第一個適配了這個特性的應用，如果有 Android 11，快來試試吧！\n\n* 全新「順滑光標」: 支持呼吸式或脈搏式跳動的光標，更溫和了，以及順滑的移動光標動畫，不再是瞬間跳躍，更流暢\n\n(👉如果您不想更新，可以長按此通知來關閉此次更新提醒，但我更想推薦大家儘可能更新，因為這是我們費盡心思想要做得更好的新版，它一定不會讓您失望的)\n\n* 適配 純純寫作桌面版、平板和外接鍵盤\n* 修復 斷網時會持續不停地彈「無網絡」提示\n* 為華為系統適配邊緣長按選擇的速度\n* 為 MIUI 適配快捷輸入欄彈出動畫\n\n* 修復 Markdown 圖片自動重新加載導致的位置偏移問題\n* 細節優化：剛啟動純純寫作後，文章最後一行可能會出現短暫的被截斷效果\n* 適配 分屏模式\n* 適配 外接鍵盤以支持「快捷輸入欄」和「藍色填字框」\n* 新增設置項：藍色填字框，支持關閉該功能\n* 優化「格式化器」，現在起，使用格式化功能後，頁面不會自動滾動到末尾了，並且光標也能保留在原來的相對位置\n\n* 支持按回車⏎跳出藍色填字框，並且有大量更新和優化，性能更好，瞬間啟動⚡\n* 修復 藍色填字框光標位置問題（特別適配 QQ 和 百度輸入法）\n* 新增 按回車⏎跳出藍色填字框功能（試試你的快捷輸入項或輸入成對符號\"\"）✨\n* 修改「移動光標」按鈕到快捷輸入欄中央👉【按住該按鈕 移動 手指】可順滑移動光標\n* 全新 快捷輸入欄 V3\n* 新增 按回車跳出填字框功能（試試你的快捷輸入項）✨\n* 適配 targetSdkVersion 29\n⌘ 支持 有序列表自動補全\n\n* 編輯器 ⇋ Markdown 預覽「雙向同步滾動」🎉\n* 支持 自動恢復文章滾動停留位置！\n* 更快的啟動速度！原來已經極快了，現在更快。靈感稍縱即逝，瞬間啟動，最快速度進入寫作\n\n* 高級只讀模式: 雙擊文本置入光標並進入編輯模式，返回鍵隱藏光標\n\n* 對所有頁面適配 Android 10 底部手勢橫條\n* 支持「查找替換」⇋「搜索文章」模式切換\n* 支持在 快捷輸入項 中插入日期或時間變量\n* 支持 純純寫作桌面版字數統計\n* 支持 Google雲備份\n* 支持「多關鍵詞聯合搜索」\n* 新增 更好的快速滾動條滑塊，避免邊緣手勢衝突\n* 通過橫向劃動編輯器可快速進入 Markdown 預覽頁面\n* 新增「Markdown 作為新建文章默認模式」設置項\n* 更快的啟動速度⚡️，以及絲滑流暢的寫作體驗",
    "zh-TW": "* 支援 Android 11 的軟鍵盤動畫：神仙級特性！🥳 軟鍵盤可以隨著手指一點一點順滑地收起來了。純純寫作是全世界第一個適配了這個特性的應用，如果有 Android 11，快來試試吧！\n\n* 全新「順滑游標」: 支援呼吸式或脈搏式跳動的游標，更溫和了，以及順滑的移動游標動畫，不再是瞬間跳躍，更流暢\n\n(👉如果您不想更新，可以長按此通知來關閉此次更新提醒，但我更想推薦大家儘可能更新，因為這是我們費盡心思想要做得更好的新版，它一定不會讓您失望的)\n\n* 適配 純純寫作桌面版、平板和外接鍵盤\n* 修復 斷網時會持續不停地彈「無網路」提示\n* 為華為系統適配邊緣長按選擇的速度\n* 為 MIUI 適配快捷輸入欄彈出動畫\n\n* 修復 Markdown 圖片自動重新載入導致的位置偏移問題\n* 細節最佳化：剛啟動純純寫作後，文章最後一行可能會出現短暫的被截斷效果\n* 適配 分屏模式\n* 適配 外接鍵盤以支援「快捷輸入欄」和「藍色填字框」\n* 新增設定項：藍色填字框，支援關閉該功能\n* 最佳化「格式化器」，現在起，使用格式化功能後，頁面不會自動滾動到末尾了，並且游標也能保留在原來的相對位置\n\n* 支援按Enter⏎跳出藍色填字框，並且有大量更新和最佳化，性能更好，瞬間啟動⚡\n* 修復 藍色填字框游標位置問題（特別適配 QQ 和 百度輸入法）\n* 新增 按Enter⏎跳出藍色填字框功能（試試你的快捷輸入項或輸入成對符號\"\"）✨\n* 修改「移動游標」按鈕到快捷輸入欄中央👉【按住該按鈕 移動 手指】可順滑移動游標\n* 全新 快捷輸入欄 V3\n* 新增 按Enter跳出填字框功能（試試你的快捷輸入項）✨\n* 適配 targetSdkVersion 29\n⌘ 支援 有序列表自動補全\n\n* 編輯器 ⇋ Markdown 預覽「雙向同步滾動」🎉\n* 支援 自動復原文章滾動停留位置！\n* 更快的啟動速度！原來已經極快了，現在更快。靈感稍縱即逝，瞬間啟動，最快速度進入寫作\n\n* 進階唯讀模式: 雙擊文字置入游標並進入編輯模式，返回鍵隱藏游標\n\n* 對所有頁面適配 Android 10 底部手勢橫條\n* 支援「尋找取代」⇋「搜尋文章」模式切換\n* 支援在 快捷輸入項 中插入日期或時間變數\n* 支援 純純寫作桌面版字數統計\n* 支援 Google雲備份\n* 支援「多關鍵字聯合搜尋」\n* 新增 更好的快速滾動條滑塊，避免邊緣手勢衝突\n* 透過橫向劃動編輯器可快速進入 Markdown 預覽頁面\n* 新增「Markdown 作為建立文章預設模式」設定項\n* 更快的啟動速度⚡️，以及絲滑流暢的寫作體驗",
    "default": "* Wow! Synchronized Animating soft keyboard for Android 11\n\n* Smooth Cursor✨:\n  breathing or pulse beating cursor, and smooth cursor movement animation, which is no longer an instant jump, very nice!\n\n(👉If you don’t want to update, you can long press this notification to turn off this update reminder, but I would like to recommend that everyone please update as much as possible, because this is a new version that we have worked hard to do better, it will definitely nice and lovely)\n\nMore:\n* Adapt Pure Writer Desktop, tablet and hardware keyboard\n* Fix a detail problem: when starting Pure Writer, the last line of the article may be temporarily clipped\n* Adapt split screen mode\n* Adapt external keyboard to support Shortcut Bar and Blue Input Box\n* Optimize the \"Formatter\". From now on, after using the formatting function, the page will not automatically scroll to the end, and the cursor can remain in the original relative position\n* Fix the position offset problem caused by automatic reloading of Markdown images\n\n* Support the Enter key ⏎ to jump out of blue input block\n* Modify \"Move Cursor\" button to center of Shortcut Bar, 👉 [Press and MOVE finger to move Cursor smoothly]\n* Support the Enter key to jump out of input block✨\n* Support auto completion for ordered lists\n\n* Sync scrolling for Editor ⇋ Markdown Preview\n* Read-only Mode️: double-clicking to place cursor\n* Adapt transparent navigation bar & Android 11\n* Support date time variables in Text Shortcut\n\n* Support Google Drive\n* Faster launching⚡️, and more silky smooth writing experience"
  }
}
